aabzel/trunk/source/mcal/mcal_stm32_hal/dma_channel/dma_channel_mcal.c
#include "dma_channel_mcal.h"

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "array.h"
#include "mcal_common.h"
#include "dma_channel_types.h"
#include "dma_custom_bindings.h"
#include "dma_custom_types.h"
#include "dma_custom_misc.h"
#include "hal_diag.h"
#include "time_mcal.h"
#include "log.h"
#include "stm32fx_hal.h"

/*
  Table 42. DMA1 request mapping
  Table 43. DMA2 request mapping
 */
const DmaInfoChannel_t DmaBannedChannels[]={
        {.dma_num=1, .stream=1, .channel=0,},
        {.dma_num=1, .stream=6, .channel=0,},
        {.dma_num=1, .stream=1, .channel=1,},
        {.dma_num=1, .stream=3, .channel=1,},
        {.dma_num=1, .stream=1, .channel=2,},
        {.dma_num=1, .stream=5, .channel=6,},
        {.dma_num=1, .stream=7, .channel=6,},
        {.dma_num=1, .stream=0, .channel=7,},
        {.dma_num=2, .stream=7, .channel=0,},
        {.dma_num=2, .stream=0, .channel=1,},
        {.dma_num=2, .stream=2, .channel=2,},
        {.dma_num=2, .stream=1, .channel=3,},
        {.dma_num=2, .stream=4, .channel=3,},
        {.dma_num=2, .stream=6, .channel=3,},
        {.dma_num=2, .stream=7, .channel=3,},
        {.dma_num=2, .stream=4, .channel=4,},
        {.dma_num=2, .stream=0, .channel=5,},
        {.dma_num=2, .stream=5, .channel=5,},
        {.dma_num=2, .stream=7, .channel=6,},
        {.dma_num=2, .stream=0, .channel=7,},
};

const DmaInfoChannel_t DmaSpareChannels[]={
        {.dma_num=2, .stream=1, .channel=0,},
        {.dma_num=2, .stream=3, .channel=0,},
        {.dma_num=2, .stream=5, .channel=0,},
        {.dma_num=2, .stream=1, .channel=1,},
#if 0
        {.dma_num=2, .stream=4, .channel=1,},

        {.dma_num=2, .stream=7, .channel=1,},
        {.dma_num=2, .stream=5, .channel=2,},
        {.dma_num=2, .stream=6, .channel=2,},
        {.dma_num=2, .stream=7, .channel=2,},
#endif
};

uint32_t dma_channel_spare_get_cnt(void) {
    uint32_t cnt = ARRAY_SIZE(DmaSpareChannels);
    return cnt;
}

#define DMA_INT_PRIORITY 0

#define DMA1_CHANNEL_INFO                                                                                              \
    {                                                                                                                  \
        .dma_num = 1,                                                                                                  \
        .channel = 0,                                                                                                  \
        .DMA_STREAMx = DMA1_Stream0,                                                                                   \
        .irq_n = DMA1_Stream0_IRQn,                                                                                    \
        .valid = true,                                                                                                 \
    },                                                                                                                 \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 1,                                                                                              \
            .DMA_STREAMx = DMA1_Stream1,                                                                               \
            .irq_n = DMA1_Stream1_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 2,                                                                                              \
            .DMA_STREAMx = DMA1_Stream2,                                                                               \
            .irq_n = DMA1_Stream2_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 3,                                                                                              \
            .DMA_STREAMx = DMA1_Stream3,                                                                               \
            .irq_n = DMA1_Stream3_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 4,                                                                                              \
            .DMA_STREAMx = DMA1_Stream4,                                                                               \
            .irq_n = DMA1_Stream4_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 5,                                                                                              \
            .DMA_STREAMx = DMA1_Stream5,                                                                               \
            .irq_n = DMA1_Stream5_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 6,                                                                                              \
            .DMA_STREAMx = DMA1_Stream6,                                                                               \
            .irq_n = DMA1_Stream6_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 1,                                                                                              \
            .channel = 7,                                                                                              \
            .DMA_STREAMx = DMA1_Stream7,                                                                               \
            .irq_n = DMA1_Stream7_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },

