aabzel/trunk/source/mcal/mcal_stm32_hal/dma_channel/dma_channel_mcal.c
#define DMA2_CHANNEL_INFO                                                                                              \
    {                                                                                                                  \
        .dma_num = 2,                                                                                                  \
        .channel = 0,                                                                                                  \
        .DMA_STREAMx = DMA2_Stream0,                                                                                   \
        .irq_n = DMA2_Stream0_IRQn,                                                                                    \
        .valid = true,                                                                                                 \
    },                                                                                                                 \
    {                                                                                                              \
        .dma_num = 2,                                                                                              \
        .channel = 1,                                                                                              \
        .DMA_STREAMx = DMA2_Stream1,                                                                               \
        .irq_n = DMA2_Stream1_IRQn,                                                                                \
        .valid = true,                                                                                             \
    },                                                                                                             \
    {                                                                                                              \
        .dma_num = 2,                                                                                              \
        .channel = 2,                                                                                              \
        .DMA_STREAMx = DMA2_Stream2,                                                                               \
        .irq_n = DMA2_Stream2_IRQn,                                                                                \
        .valid = true,                                                                                             \
    },                                                                                                             \
    {                                                                                                              \
        .dma_num = 2,                                                                                              \
        .channel = 3,                                                                                              \
        .DMA_STREAMx = DMA2_Stream3,                                                                               \
        .irq_n = DMA2_Stream3_IRQn,                                                                                \
        .valid = true,                                                                                             \
    },                                                                                                             \
    {                                                                                                              \
        .dma_num = 2,                                                                                              \
        .channel = 4,                                                                                              \
        .DMA_STREAMx = DMA2_Stream4,                                                                               \
        .irq_n = DMA2_Stream4_IRQn,                                                                                \
        .valid = true,                                                                                             \
    },                                                                                                             \
        {                                                                                                              \
            .dma_num = 2,                                                                                              \
            .channel = 5,                                                                                              \
            .DMA_STREAMx = DMA2_Stream5,                                                                               \
            .irq_n = DMA2_Stream5_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 2,                                                                                              \
            .channel = 6,                                                                                              \
            .DMA_STREAMx = DMA2_Stream6,                                                                               \
            .irq_n = DMA2_Stream6_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },                                                                                                             \
        {                                                                                                              \
            .dma_num = 2,                                                                                              \
            .channel = 7,                                                                                              \
            .DMA_STREAMx = DMA2_Stream7,                                                                               \
            .irq_n = DMA2_Stream7_IRQn,                                                                                \
            .valid = true,                                                                                             \
        },

#define DMA_CHANNEL_INFO                                                                                               \
    DMA1_CHANNEL_INFO                                                                                                  \
    DMA2_CHANNEL_INFO

