aabzel/trunk/source/mcal/mcal_stm32_hal/dma_channel/dma_channel_mcal.c
static const DmaChannelInfo_t DmaChannelInfo[] = { DMA_CHANNEL_INFO };

const DmaChannelInfo_t* DmaChannelGetInfo(uint8_t num, DmaChannel_t stream) {
    uint32_t cnt = ARRAY_SIZE(DmaChannelInfo);
    uint32_t i = 0;
    DmaChannelInfo_t *Node = NULL;
    for (i = 0; i < cnt; i++) {
        if(DmaChannelInfo[i].valid) {
            if(num == DmaChannelInfo[i].dma_num) {
                if(stream == DmaChannelInfo[i].channel) {
                    Node = &DmaChannelInfo[i];
                }
            }
        }
    }
    return Node;
}

DMA_Stream_TypeDef* DmaChannelToDMAx(uint8_t dma_num, DmaChannel_t channel) {
    DMA_Stream_TypeDef *DMA_STREAMx = NULL;
    const DmaChannelInfo_t *ChannelInfo = DmaChannelGetInfo(dma_num, channel);
    if(ChannelInfo) {
        DMA_STREAMx = ChannelInfo->DMA_STREAMx;
    }
    return DMA_STREAMx;
}

static bool dma_channel_wait_disabled(DmaChannelHandle_t *Node) {
    bool loop = true;
    bool res = false;
    uint32_t start_ms = time_get_ms32();
    while(loop){
        DmaStreamConfReg_t SxCR;
        SxCR.dword = Node->DMA_STREAMx->CR;
        if(0==SxCR.en) {
            res = true;
            loop = false;
            break;
        }
        loop = time_wait_timeout(  start_ms, 50);
    }
    return res;
}

bool dma_channel_start_ll(DmaChannelHandle_t* Node) {
    bool res = true;
    DmaStreamConfReg_t SxCR;
    SxCR.dword = Node->DMA_STREAMx->CR;
    SxCR.en = 1;
    Node->DMA_STREAMx->CR = SxCR.dword;
    return res;
}

/*TODO make LUT*/
static uint32_t DmaGetChannel(uint8_t channel) {
    uint32_t code = 0xFFFFFFFF;
    switch (channel) {
#ifdef DMA_CHANNEL_0
    case DMA_CHAN_0:
        code = DMA_CHANNEL_0;
        break;
#endif

#ifdef DMA_CHANNEL_1
    case DMA_CHAN_1:
        code = DMA_CHANNEL_1;
        break;
#endif

#ifdef DMA_CHANNEL_2
    case DMA_CHAN_2:
        code = DMA_CHANNEL_2;
        break;
#endif

#ifdef DMA_CHANNEL_3
    case DMA_CHAN_3:
        code = DMA_CHANNEL_3;
        break;
#endif

#ifdef DMA_CHANNEL_4
    case DMA_CHAN_4:
        code = DMA_CHANNEL_4;
        break;
#endif

#ifdef DMA_CHANNEL_5
    case DMA_CHAN_5:
        code = DMA_CHANNEL_5;
        break;
#endif

#ifdef DMA_CHANNEL_6
    case DMA_CHAN_6:
        code = DMA_CHANNEL_6;
        break;
#endif

#ifdef DMA_CHANNEL_7
    case DMA_CHAN_7:
        code = DMA_CHANNEL_7;
        break;
#endif

#ifdef DMA_CHANNEL_8
    case DMA_CHAN_8:
        code = DMA_CHANNEL_8;
        break;
#endif

#ifdef DMA_CHANNEL_9
    case DMA_CHAN_9:
        code = DMA_CHANNEL_9;
        break;
#endif

#ifdef DMA_CHANNEL_10
    case DMA_CHAN_10:
        code = DMA_CHANNEL_10;
        break;
#endif

#ifdef DMA_CHANNEL_11
    case DMA_CHAN_11:
        code = DMA_CHANNEL_11;
        break;
#endif

#ifdef DMA_CHANNEL_12
    case DMA_CHAN_12:
        code = DMA_CHANNEL_12;
        break;
#endif

#ifdef DMA_CHANNEL_13
    case DMA_CHAN_13:
        code = DMA_CHANNEL_13;
        break;
#endif

#ifdef DMA_CHANNEL_14
    case DMA_CHAN_14:
        code = DMA_CHANNEL_14;
        break;
#endif

#ifdef DMA_CHANNEL_15
    case DMA_CHAN_15:
        code = DMA_CHANNEL_15;
        break;
#endif
    default:
        break;
    }
    return code;
}

#define COPY_DMA_STREAM_BITS(BIT)                                                                                      \
    do {                                                                                                               \
        DmaStreamIntStatusReg.teif = Reg.tcif##BIT;                                                                    \
        DmaStreamIntStatusReg.tcif = Reg.tcif##BIT;                                                                    \
        DmaStreamIntStatusReg.feif = Reg.feif##BIT;                                                                    \
        DmaStreamIntStatusReg.dmeif = Reg.dmeif##BIT;                                                                  \
        DmaStreamIntStatusReg.htif = Reg.htif##BIT;                                                                    \
    } while(0);

DmaStreamIntStatusReg_t DmaGetStream(uint8_t dma_num, uint8_t stream_num) {
    DmaStreamIntStatusReg_t DmaStreamIntStatusReg;
    memset(&DmaStreamIntStatusReg, 0, sizeof(DmaStreamIntStatusReg_t));
    DMA_TypeDef *DMAx = DmaNum2DMAx(dma_num);
    if(DMAx) {
        if(stream_num <= 3) {
            DmaLowIntStatusReg_t Reg;
            Reg.reg_val = DMAx->LISR;
            switch (stream_num) {
            case 0: {
                COPY_DMA_STREAM_BITS(0)
            }
                break;
            case 1: {
                COPY_DMA_STREAM_BITS(1)
            }
                break;
            case 2: {
                COPY_DMA_STREAM_BITS(2)
            }
                break;
            case 3: {
                COPY_DMA_STREAM_BITS(3)
            }
                break;
            default:
                break;
            }
        }
        if((4 <= stream_num) && (stream_num <= 7)) {
            DmaHighIntStatusReg_t Reg;
            Reg.reg_val = DMAx->HISR;
            switch (stream_num) {
            case 4: {
                COPY_DMA_STREAM_BITS(4)
            }
                break;
            case 5: {
                COPY_DMA_STREAM_BITS(5)
            }
                break;
            case 6: {
                COPY_DMA_STREAM_BITS(6)
            }
                break;
            case 7: {
                COPY_DMA_STREAM_BITS(7)
            }
                break;
            default:
                break;
            }
        }
    }
    return DmaStreamIntStatusReg;
}

bool dma_channel_mux_get(DmaInfoChannel_t DmaPad, uint8_t* const mux) {
    * mux = 0xFF;
    return true;
}

uint32_t dma_channel_cnt_get(DmaInfoChannel_t DmaPad){
    uint32_t cnt = 0 ;
    DmaChannelHandle_t* Node=DmaPadGetNodeItem(DmaPad);
    if(Node){
        cnt= __HAL_DMA_GET_COUNTER(&(Node->dma_h));
    }
    return cnt;
}



static bool dma_channel_stop_ll(DmaChannelHandle_t* Node) {
    bool res = true;
    DmaStreamConfReg_t SxCR;
    SxCR.dword = Node->DMA_STREAMx->CR;
    SxCR.en = 0;
    Node->DMA_STREAMx->CR = SxCR.dword;

    res = dma_channel_wait_disabled(Node) ;
    return res;
}

bool dma_channel_restart(DmaInfoChannel_t DmaPad, uint16_t num_data_items_to_tx) {
    bool res = true;
    DmaChannelHandle_t *Node = DmaPadGetNodeItem(DmaPad);
    if(Node) {
        res = dma_channel_stop_ll(Node);
        DmaStreamRegNumOfData_t SxNDTR;


        SxNDTR.dword = Node->DMA_STREAMx->NDTR;
        SxNDTR.NDT = num_data_items_to_tx;
        Node->DMA_STREAMx->NDTR = SxNDTR.dword;
        res = dma_channel_start_ll(Node);
    }
    return res;
}




