aabzel/trunk/source/mcal/mcal_stm32_hal/dma_channel/dma_channel_mcal.c
bool dma_channel_priority_get(DmaInfoChannel_t DmaPad, uint8_t* priority) {
    bool res = false;
    return res;
}

bool dma_channel_init_stm_init(const DmaChannelConfig_t* const ChannelConfig, DMA_InitTypeDef* const pInit) {
    bool res = false;
    if(pInit) {
        pInit->FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        pInit->FIFOMode = DmaGetFiFoNode(ChannelConfig->fifo);
        pInit->Channel = DmaGetChannel(ChannelConfig->DmaChPad.channel);
        pInit->Direction = DmaDirToStm32DmaDir(ChannelConfig->dir);
        pInit->PeriphInc = DmaGetPeriphInc(ChannelConfig->per_inc);
        pInit->MemInc = DmaGetMemInc(ChannelConfig->mem_inc);
        pInit->PeriphDataAlignment = DmaGetPeriphDataAlignment(ChannelConfig->aligment_per);
        pInit->MemDataAlignment = DmaGetMemDataAlignment(ChannelConfig->aligment_mem);
        pInit->Mode = DmaGetMode(ChannelConfig->mode);
        pInit->Priority = DmaGetPriority(ChannelConfig->priority);
        pInit->MemBurst = MemoryBurst2StmMemoryBurst(ChannelConfig->memory_burst);
        pInit->PeriphBurst = PeriphBurst2StmPeriphBurst(ChannelConfig->periph_burst);
        res = true;
    }
    return res;
}

bool dma_channel_init_one(uint8_t num) {
    bool res = false;
    LOG_WARNING(DMA_CHANNEL, "N:%u=%s", num, DmaChannnelNumToStr(num));
    const DmaChannelConfig_t *ChannelConfig = DmaChannelGetConfig(num);
    if(ChannelConfig) {
        DmaChannelHandle_t *DmaChNode = DmaChannelGetNode(num);
        if(DmaChNode) {
            res = dma_channel_init_common(ChannelConfig, DmaChNode);
        }

        uint8_t dma_num = ChannelConfig->DmaChPad.dma_num;
        uint8_t stream_num = ChannelConfig->DmaChPad.stream;
        LOG_WARNING(LG_DMA, "%u,DMA%u,Stream_%u,Init", num, dma_num, stream_num);
        DMA_Stream_TypeDef *DMAx = NULL;
        DMAx = DmaChannelToDMAx(dma_num, stream_num);
        if(DMAx) {
            const DmaInfo_t *Info = DmaGetInfo(dma_num);
            if(Info) {
                DmaHandle_t *Node = DmaGetNode(dma_num);
                if(Node) {
                    Node->DMAx = Info->DMAx;
                    const DmaChannelInfo_t *ChannelInfo = DmaChannelGetInfo(dma_num, (DmaChannel_t) stream_num);
                    if(ChannelInfo) {
                        HAL_NVIC_SetPriority(ChannelInfo->irq_n, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
                        HAL_NVIC_EnableIRQ(ChannelInfo->irq_n);
                        DmaChNode->dma_h.Instance = ChannelInfo->DMA_STREAMx; // DMA_Stream_TypeDef
                        res = dma_channel_init_stm_init(ChannelConfig, &DmaChNode->dma_h.Init);
                        // Node->dma_h.XferAbortCallback=;
                        HAL_StatusTypeDef ret = HAL_DMA_Init(&DmaChNode->dma_h);
                        if(HAL_OK == ret) {
                            LOG_INFO(LG_DMA, "Init Id:%u Dma:%u Stream:%u " LOG_OK, num, dma_num, stream_num);
                            res = true;
#ifdef HAS_ADC
                            //AdcHandle_t* Adc = AdcGetNode(1);
                            //if(Adc) {
                            //    Adc->adc_h.DMA_Handle = &(Node->dma_h);
                            //    Node->dma_h.Parent = &(Adc->adc_h);
                            //}
#endif
                            // res = dma_start(dma_num, ChannelConfig->base_addr_source, ChannelConfig->base_addr_destination, ChannelConfig->move_size);
                        } else {
                            LOG_ERROR(LG_DMA, "%u Stream %u InitErr %s", dma_num, stream_num, HalStatusToStr(ret));
                            res = false;
                        }
                    }
                }
            }

        } else {
            LOG_ERROR(LG_DMA, "InstErr");
        }
    } else {
        LOG_ERROR(LG_DMA, "ConfigErr");
    }
    return res;
}

bool dma_channel_init_interrupts(void) {
#if 0
    LOG_WARNING(LG_DMA, "DMA1 ISR init");
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
#endif /*HAS_DMA1*/

#if 0
    LOG_WARNING(LG_DMA, "DMA2 ISR init");
    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);

    HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, DMA_INT_PRIORITY, DMA_INT_PRIORITY);
    HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
#endif /*HAS_DMA2*/
    return true;
}

bool dma_channel_priority_set(DmaInfoChannel_t DmaPad, uint8_t priority) {
    bool res = false;
    return res;
}

/* num_data_reg - DMA stream x number of data register     */
bool dma_channel_cnt_set(const DmaInfoChannel_t DmaPad,
                         const uint32_t num_data_reg) {
    bool res = false;
    DmaChannelHandle_t* Node = DmaPadGetNodeItem(DmaPad);
    if(Node) {
        __HAL_DMA_DISABLE(&(Node->dma_h));
        res = dma_channel_wait_disabled(Node) ;

        __HAL_DMA_SET_COUNTER(&(Node->dma_h), num_data_reg);
        __HAL_DMA_ENABLE(&(Node->dma_h)) ;
        res = true;
    }
    return res;
}

bool dma_memcpy(void* const destination, const void* const source, uint32_t size) {
    bool res = false;
    if(destination && source && size) {
        __HAL_RCC_DMA2_CLK_ENABLE();
        static DMA_HandleTypeDef DmaHandleMemCpy;

        DmaHandleMemCpy.Instance = DMA2_Stream0;
        DmaHandleMemCpy.Init.Channel = DMA_CHANNEL_0;
        DmaHandleMemCpy.Init.Direction = DMA_MEMORY_TO_MEMORY;
        DmaHandleMemCpy.Init.PeriphInc = DMA_PINC_ENABLE;
        DmaHandleMemCpy.Init.MemInc = DMA_MINC_ENABLE;
        DmaHandleMemCpy.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        DmaHandleMemCpy.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        DmaHandleMemCpy.Init.Mode = DMA_NORMAL;
        DmaHandleMemCpy.Init.Priority = DMA_PRIORITY_HIGH;

        HAL_StatusTypeDef ret = HAL_DMA_Init(&DmaHandleMemCpy);
        if(HAL_OK == ret) {
            if(HAL_DMA_Start(&DmaHandleMemCpy, (uint32_t) source, (uint32_t) destination, size) == HAL_OK) {
                uint32_t timeout = 1000;
                uint32_t tickstart = HAL_GetTick();

                while((HAL_DMA_PollForTransfer(&DmaHandleMemCpy, HAL_DMA_FULL_TRANSFER, timeout)) != HAL_OK) {
                    if((HAL_GetTick() - tickstart) > timeout) {
                        // Таймаут - останавливаем DMA
                        HAL_DMA_Abort(&DmaHandleMemCpy);
                        break;
                    }
                }

                if(HAL_DMA_GetState(&DmaHandleMemCpy) == HAL_DMA_STATE_READY) {
                    res = true;
                }
            }
        }

        //HAL_DMA_DeInit(&DmaHandleMemCpy);

        //__HAL_RCC_DMA2_CLK_DISABLE();
    }

    return res;
}

bool dma_memcpy_custom_ll(void* const destination,
                          const void* const source,
                          uint32_t size,
                          uint8_t dma_num,
                          uint8_t stream,
                          uint8_t channel) {
    bool res = false;
    if(destination && source && size) {
        dma_init_clock(dma_num);
        static DMA_HandleTypeDef hdma_memcpy = {0};
        const DmaChannelInfo_t *Info = DmaChannelGetInfo(dma_num, stream);
        if(Info) {
            hdma_memcpy.Instance = Info->DMA_STREAMx;
            hdma_memcpy.Init.Channel = DmaGetChannel(channel);
            hdma_memcpy.Init.Direction = DMA_MEMORY_TO_MEMORY;
            hdma_memcpy.Init.PeriphInc = DMA_PINC_ENABLE;
            hdma_memcpy.Init.MemInc = DMA_MINC_ENABLE;
            hdma_memcpy.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
            hdma_memcpy.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
            hdma_memcpy.Init.Mode = DMA_NORMAL;
            hdma_memcpy.Init.Priority = DMA_PRIORITY_HIGH;
            hdma_memcpy.Init.PeriphBurst = DMA_PBURST_SINGLE ;
            hdma_memcpy.Init.MemBurst =  DMA_MBURST_SINGLE;
            hdma_memcpy.Init.FIFOMode =  DMA_FIFOMODE_DISABLE;
            hdma_memcpy.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL ;

            HAL_StatusTypeDef ret = HAL_DMA_Init(&hdma_memcpy);
            if(HAL_OK == ret) {
                ret = HAL_DMA_Start(&hdma_memcpy, (uint32_t) source,
                                               (uint32_t) destination,
                                               size) ;
                if( HAL_OK == ret ) {
                    uint32_t timeout = 1000;
                    uint32_t tickstart = HAL_GetTick();

