aabzel/trunk/source/mcal/mcal_stm32_hal/dma_channel/dma_channel_mcal.c
                    while((HAL_DMA_PollForTransfer(&hdma_memcpy, HAL_DMA_FULL_TRANSFER, timeout)) != HAL_OK) {
                        if((HAL_GetTick() - tickstart) > timeout) {
                            HAL_DMA_Abort(&hdma_memcpy);
                            res = false;
                            break;
                        }
                    }

                    if(HAL_DMA_GetState(&hdma_memcpy) == HAL_DMA_STATE_READY) {
                        res = true;
                    }
                }
            }
        }
    }

    return res;
}

DMA_Stream_TypeDef* dma_stream_num_2_prt(const uint8_t dma_num,
                                         const uint8_t stream) {
    DMA_Stream_TypeDef* DMA_STREAMx = NULL;
    const DmaChannelInfo_t* Info = DmaChannelGetInfo(dma_num, stream) ;
    if (Info) {
        DMA_STREAMx = Info->DMA_STREAMx;
    }
    return DMA_STREAMx;
}

bool dma_channel_half_move_it_ctrl(const DmaInfoChannel_t DmaPad, const bool en) {
    bool res = false ;
    DMA_Stream_TypeDef* DMA_STREAMx=dma_stream_num_2_prt(DmaPad.dma_num, DmaPad.stream);
    if(DMA_STREAMx){
        DmaStreamConfReg_t CfgReg;
         CfgReg.dword = DMA_STREAMx->CR;
         CfgReg.htie = en ;
         DMA_STREAMx->CR = CfgReg.dword;
         res = true;
    }
    return res;
}

uint8_t dma_channel_half_move_it_get(const DmaInfoChannel_t DmaPad){
    uint8_t on_off = 0xEE;
    DMA_Stream_TypeDef* DMA_STREAMx = dma_stream_num_2_prt(DmaPad.dma_num, DmaPad.stream);
    if(DMA_STREAMx) {
        DmaStreamConfReg_t CfgReg;
        CfgReg.dword = DMA_STREAMx->CR;
        on_off = CfgReg.htie  ;
    }
    return on_off;
}
